Revit 2024 API
OpenOptions.DetachFromCentralOption Property
 An option that specifies whether or not a workset-enabled document is detached from its central document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public DetachFromCentralOption DetachFromCentralOption { get; set; }
Visual Basic
Public Property DetachFromCentralOption As DetachFromCentralOption
	Get
	Set
Visual C++
public:
property DetachFromCentralOption DetachFromCentralOption {
	DetachFromCentralOption get ();
	void set (DetachFromCentralOption value);
}
Field Value
 The default value is DetachFromCentralOption.DoNotDetach.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
OpenOptions Class
Autodesk.Revit.DB Namespace